Revit 2027 API
ImageType.ExternalResourceType Property
 The type of external resources that represents images.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType ExternalResourceType { get; }
Public Shared ReadOnly Property ExternalResourceType As ExternalResourceType
	Get
public:
static property ExternalResourceType^ ExternalResourceType {
	ExternalResourceType^ get ();
}
static member ExternalResourceType : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ImageType Class
Autodesk.Revit.DB Namespace